# Петя, Катя и Сережа делают из бумаги журавликов. Вместе они сделали n журавликов.

# Сколько журавликов сделал каждый ребенок, если известно, что Петя и Сережа сделали одинаковое количество журавликов, а Катя сделала в два раза больше журавликов, чем Петя и Сережа вместе?

# Выведите через пробел количество журавликов, сделанных Петей, Катей и Сережей.

#n = 24


# for v in range(0,n):
#     if (v+1)+(v+1)+(((v+1)+(v+1))*2)==n:
#         print(str(v+1)+" "+str((((v+1)+(v+1))*2))+" "+str(v+1))
#         break