# Задача №9. Решение в группах
# По данному целому неотрицательному n вычислите 
# значение n!. N! = 1 * 2 * 3 * … * N (произведение всех 
# чисел от 1 до N) 0! = 1 Решить задачу используя цикл 
# while
# Input: 5
# Output: 120 

# n = int(input("\nВведите число: "))
# res = 1
# while n > 0:
#     res *= n
#     n -= 1
# print(res)


# n = 5
# factN = 1
# while n > 1:
#     factN = factN * (n)
#     n = n - 1
# print (factN)


# n = int(input("Введите число: "))
# factorial_n = 1
# i = 1
# while i <= n:
#     factorial_n = factorial_n * i
#     i += 1
# print(factorial_n)