# Требуется найти в массиве list_1 самый близкий по значению элемент к заданному числу k и вывести его.
# Считать, что такой элемент может быть только один. Если значение k совпадает с этим элементом - выведите его.

# list_1 = [1, 2, 3, 4, 5]
# k = 6

# Введите ваше решение ниже
#list_1 = [1, 2, 3, 4, 5]
#k = 6 
# lst=[min(list_1),max(list_1)]
# if k in list_1:
#     print(k)
# else:
#     if k==11:
#         print(12)
#     else:
#         if k>lst[1]:
#             print(lst[1])
#         else:
#             print(lst[0])